Revit 2027 API
PointCloudFilter.Clone Method
 Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudFilter Clone()
Public Function Clone As PointCloudFilter
public:
PointCloudFilter^ Clone()
member Clone : unit -> PointCloudFilter
Return Value
PointCloudFilter
 A copy of the original filter.
See Also
Reference
PointCloudFilter Class
Autodesk.Revit.DB.PointClouds Namespace